{"data":{"site":{"siteMetadata":{"title":"Blog on AWS","author":"Jacob Jones"}},"markdownRemark":{"id":"ab014b88-75f2-5bc3-a8ca-c63240999929","excerpt":"Just last month on 2-20-2019 I passed my  AWS Certified Solutions Architect Associate  exam. This was accomplished with no prior AWS experience and only…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/e5b02b04f01add2b886cfbca6e00bb2d/4fd93/AWS_Certified_Logo_SAA_294x230_Color.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 286px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 14.685314685314685%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAADCAYAAACTWi8uAAAACXBIWXMAAAsSAAALEgHS3X78AAAA3UlEQVQI12NwdXFzA2INLzcXewNLL+tfCxTVfswSOfxzsebN30s0HVzi21RLivLNc/OL7HMLim3y8osd8wqKXYB8OyC2zM0vtgXygexiOyAtywA0bD8Q7/RwdV1maO0z4Wa7cN7/09n//99u+v9imtIsr5TOsOKiggag5gaghj6goRVAOhGIVwHZQUB6U15+URmQXZNbUDQdaKCrMdBAIx93F00DK1/rW22Cer9XWx3+sVDt9u/pnA5OKVOUSoryTPNArisoVgFiSSAWA2JdIGYDYksgtgBi67yCIkkAhFBjoGH8qlIAAAAASUVORK5CYII='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"AWS Certified Solutions Architect Associate Logo\"\n        title=\"\"\n        src=\"/static/e5b02b04f01add2b886cfbca6e00bb2d/4fd93/AWS_Certified_Logo_SAA_294x230_Color.png\"\n        srcset=\"/static/e5b02b04f01add2b886cfbca6e00bb2d/1d77c/AWS_Certified_Logo_SAA_294x230_Color.png 148w,\n/static/e5b02b04f01add2b886cfbca6e00bb2d/4fd93/AWS_Certified_Logo_SAA_294x230_Color.png 286w\"\n        sizes=\"(max-width: 286px) 100vw, 286px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Just last month on 2-20-2019 I passed my <strong>AWS Certified Solutions Architect Associate</strong> exam. This was accomplished with no prior AWS experience and only studying from January 5th thorough February 19th. I want to share the steps I took to pass as well as give you a few tips on what to expect when you go to take the exam. </p>\n<h2>How to Study for Your Exam</h2>\n<p>There are a few steps I took in order to study for the exam. Some of them do have cost associated, but if you are serious about passing your exam they are necessary. Also, most of what I used were tools from <a href=\"acloud.guru\">A Cloud Guru</a>, but they are not a sponsor of this post. </p>\n<h3>1. Complete AWS Certified Solutions Architect Associate Course on A Cloud Guru</h3>\n<p><a href=\"acloud.guru\">A Cloud Guru</a> is an excellent training website that will help you to pass your exam. Following the training here was the biggest part of my preparation. The course consists of about 22 hours of video which is broken up into 135 lessons. Part of the videos are going to be labs, so expect it to take more than 22 hours to finish studying. I did not record the time I spent studying, but I would estimate I spent at least 60 hours total. </p>\n<p>You will find chapters which are broken up into lessons. Each lesson contains bite sized content of 20 mintues or less to do a lab or cover a concept. At the end of each chapter there will be a summary which is followed by a quiz. You definitely want to be able to get 100% on these quizzes before moving to the next chapter. </p>\n<p>You will want to finish all of the training and labs while getting 100% on the quizzes at the end of each chapter. After that you will want to go back and do the labs once again for the topics you are unsure about. In particular I would highly suggest going over the Load Balancer lessons a second time and make sure you understand everything load balancers can and cannot do. </p>\n<h3>2. Review White Papers</h3>\n<p>For reviewing whitepapers there are only a couple that you need to worry about.</p>\n<ul>\n<li><a href=\"https://d0.awsstatic.com/whitepapers/AWS_Cloud_Best_Practices.pdf\">Architecting for the Cloud: AWS Best Practices</a></li>\n<li><a href=\"https://d1.awsstatic.com/whitepapers/architecture/AWS_Well-Architected_Framework.pdf\">AWS Well-Architected Framework</a></li>\n</ul>\n<p>The AWS Well-Architected Framework is pretty long, as long as you know what the pillars are and understand the general idea behind them you will be fine.</p>\n<h3>3. Take Practice Exams with the Exam Simulator</h3>\n<p>After you finish the above steps you will want to use the <a href=\"https://help.acloud.guru/hc/en-us/articles/115004506854-The-A-Cloud-Guru-Exam-Simulator-\">exam simularor</a> for A Cloud Guru which simulates the AWS exam asking similar style questions. I took the exam simulator several times. Each time I took it, I would go back and complete the lessons, labs, and summary again for any area I was weak in. </p>\n<p>For example - if I got questions wrong that pertained to load balancers, I would go through that section of the course again. You can even do this for the domains that the test covers, see the demo of the exam simulator results below:</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/yQQYaWgSQiE?rel=0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>I used the exam simulator until I go to the point I scored a 93, 88, 90, and 88. After reaching these scores I felt confident that I could pass the AWS Solutions Architect Associate exam. However, I will say even with this level of preparation and confidence I was caught off guard with the difficulty of the exam. </p>\n<p>That leads me into step 4, which I did not do, but I would highly suggest.</p>\n<p><strong>Beware: The AWS exam is far more diffucult when it comes to questions about how to architect environments. Expect to do AT LEAST 10 points worse on the real exam.</strong></p>\n<h3>4. Pay for the AWS Practice Exam</h3>\n<p>When I went to sit for the exam a lot of the questions were much more complex than the ones in the exam simulator. If this is your first Associate level AWS exam,  I would highly suggest taking a practice exam. See the below question which can be found from the <a href=\"https://d1.awsstatic.com/training-and-certification/docs/AWS_Certified_Solutions_Architect_Associate_Sample_Questions.pdf\">sample questions</a> provided for this exam:</p>\n<blockquote>\n<p><strong>A web application allows customers to upload orders to an S3 bucket. The resulting Amazon S3 events trigger a Lambda function that inserts a message to an SQS queue. A single EC2 instance reads messages from the queue, processes them, and stores them in an DynamoDB table partitioned by unique order ID. Next month traffic is expected to increase by a factor of 10 and a Solutions Architect is reviewing the architecture for possible scaling problems.</strong></p>\n<p><strong>Which component is MOST likely to need re-architecting to be able to scale to accommodate the new traffic?</strong></p>\n<p>A. Lambda function</p>\n<p>B. SQS queue</p>\n<p>C. EC2 instance</p>\n<p>D. DynamoDB table</p>\n</blockquote>\n<p>Because of questions like this, I highly suggest that you give the <a href=\"https://www.aws.training/certification?src=cert-prep\">practice exam</a> a shot. If I could go back and do it over again I would have taken a practice test to have an idea of what to expect. </p>\n<p>Why? You ask… Well finishing your exam with only 5 seconds left and about 12 flagged questions you never reviewed is not a good feeling. Still passed though. 😀</p>\n<h2>Conclusion</h2>\n<p>In summary if you want to pass your AWS Certified Solutions Architect Associate exam, you should:</p>\n<ol>\n<li>\n<p>Complete the course over at <a href=\"https://acloud.guru/\">A Cloud Guru</a></p>\n<ol>\n<li>Pass quizzes with 100%</li>\n<li>Do labs multiple times for concepts you struggle with</li>\n<li>Review summary lessons multiple times</li>\n</ol>\n</li>\n<li>\n<p>Review whitepapers</p>\n<ol>\n<li><a href=\"https://d0.awsstatic.com/whitepapers/AWS_Cloud_Best_Practices.pdf\">Architecting for the Cloud: AWS Best Practices</a></li>\n<li><a href=\"https://d1.awsstatic.com/whitepapers/architecture/AWS_Well-Architected_Framework.pdf\">AWS Well-Architected Framework</a> - Focus on the pillars</li>\n</ol>\n</li>\n<li>\n<p>Take the <a href=\"https://help.acloud.guru/hc/en-us/articles/115004506854-The-A-Cloud-Guru-Exam-Simulator-\">exam simulator</a> over at A Cloud Guru.</p>\n<ol>\n<li>Take it several times until you are consistently close to 90%</li>\n<li>For any domain you struggle with go back and review lessons and do labs</li>\n</ol>\n</li>\n<li>If it is your first AWS exam, pay for the <a href=\"https://www.aws.training/certification?src=cert-prep\">practice exam</a>.</li>\n</ol>","frontmatter":{"title":"Pass Your AWS Certified Solutions Architect Associate Exam","date":"March 08, 2019"}}},"pageContext":{"slug":"/Pass Your AWS Certified Solutions Architect Associate Exam/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}},"next":null}}